improve readme
